src/config/Documents/ЗакрытиеЗаказовПокупателейСезонных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПокупателейСезонных</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателяСезонный</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПокупателейСезонные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиПоЗаказам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателяСезонный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРезерве</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПокупателейСезонные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателейСезонные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателяСезонный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВРезерве</Name>
					<Comment>В проделенных неотгруженных заказах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ЗакрытиеЗаказовПокупателейСезонных/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 // по сезонным заказам покупателя
	//сравним остатки по записям из таб. части. Спишем наименьшее и остатка и кол-ва из таб части 
	//НаборДвижений =  Движения.ЗаказыПокупателейСезонные;
	//НаборДвижений.Очистить();
 	Запрос = Новый Запрос;
	Запрос.Текст = 
				   "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателяСезонный,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Контрагент,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Номенклатура,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Аналог,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателя,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ВРезерве,
				   |	СУММА(ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Количество) КАК Количество
				   |ПОМЕСТИТЬ СезонныеЗаказы
				   |ИЗ
				   |	Документ.ЗакрытиеЗаказовПокупателейСезонных.ОстаткиПоЗаказам КАК ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам
				   |ГДЕ
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Ссылка = &Ссылка
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателяСезонный,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Контрагент,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Номенклатура,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.Аналог,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ЗаказПокупателя,
				   |	ЗакрытиеЗаказовПокупателейСезонныхОстаткиПоЗаказам.ВРезерве
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ЗаказыПокупателейСезонныеОстатки.Контрагент,
				   |	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателяСезонный,
				   |	ЗаказыПокупателейСезонныеОстатки.Номенклатура,
				   |	ЗаказыПокупателейСезонныеОстатки.Аналог,
				   |	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателя,
				   |	ЗаказыПокупателейСезонныеОстатки.ВРезерве,
				   |	ВЫБОР
				   |		КОГДА ЗаказыПокупателейСезонныеОстатки.ВРезерве
				   |			ТОГДА ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
				   |		ИНАЧЕ -ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
				   |	КОНЕЦ КАК Количество,
				   |	ЗаказыПокупателейСезонныеОстатки.Подразделение
				   |ПОМЕСТИТЬ Остатки
				   |ИЗ
				   |	РегистрНакопления.ЗаказыПокупателейСезонные.Остатки(
				   |			&МоментДокумента,
				   |			(ЗаказПокупателяСезонный, Контрагент, Номенклатура, Аналог, ЗаказПокупателя, ВРезерве) В
				   |				(ВЫБРАТЬ
				   |					СезонныеЗаказы.ЗаказПокупателяСезонный,
				   |					СезонныеЗаказы.Контрагент,
				   |					СезонныеЗаказы.Номенклатура,
				   |					СезонныеЗаказы.Аналог,
				   |					СезонныеЗаказы.ЗаказПокупателя,
				   |					СезонныеЗаказы.ВРезерве
				   |				ИЗ
				   |					СезонныеЗаказы КАК СезонныеЗаказы)) КАК ЗаказыПокупателейСезонныеОстатки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СезонныеЗаказы.ЗаказПокупателяСезонный,
				   |	СезонныеЗаказы.Контрагент,
				   |	СезонныеЗаказы.Номенклатура,
				   |	СезонныеЗаказы.Аналог,
				   |	СезонныеЗаказы.ЗаказПокупателя,
				   |	СезонныеЗаказы.ВРезерве,
				   |	ВЫБОР
				   |		КОГДА Остатки.Количество > СезонныеЗаказы.Количество
				   |			ТОГДА Остатки.Количество
				   |		ИНАЧЕ СезонныеЗаказы.Количество
				   |	КОНЕЦ КАК Количество,
				   |	ВЫБОР
				   |		КОГДА СезонныеЗаказы.ВРезерве
				   |			ТОГДА &Расход
				   |		ИНАЧЕ &Приход
				   |	КОНЕЦ КАК ВидДвижения,
				   |	Остатки.Подразделение
				   |ИЗ
				   |	Остатки КАК Остатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ СезонныеЗаказы КАК СезонныеЗаказы
				   |		ПО (СезонныеЗаказы.ЗаказПокупателяСезонный = Остатки.ЗаказПокупателяСезонный)
				   |			И (СезонныеЗаказы.Контрагент = Остатки.Контрагент)
				   |			И (СезонныеЗаказы.Номенклатура = Остатки.Номенклатура)
				   |			И (СезонныеЗаказы.Аналог = Остатки.Аналог)
				   |			И (СезонныеЗаказы.ЗаказПокупателя = Остатки.ЗаказПокупателя)
				   |			И (СезонныеЗаказы.ВРезерве = Остатки.ВРезерве)";
				   
				
	Запрос.УстановитьПараметр("МоментДокумента", ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	ТаблицаДвиженийПоЗаказам = Запрос.Выполнить().Выгрузить();
	
   	Если ТаблицаДвиженийПоЗаказам.Количество()>0 Тогда
		НаборДвижений = Движения.ЗаказыПокупателейСезонные;
		НаборДвижений.Очистить();
		НаборДвижений.Записывать = Истина;
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		ЗагрузитьВТаблицуЗначений(ТаблицаДвиженийПоЗаказам, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(МоментВремени(),"МоментВремени");
		ТаблицаДвижений.ЗаполнитьЗначения(Дата,"Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
		//НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ЗаказыПокупателейСезонные.ВыполнитьДвижения();

	КонецЕсли;

    //11.03.19 Смирнов удалим заказы
	СписокЗаказов = ТаблицаДвиженийПоЗаказам.ВыгрузитьКолонку("ЗаказПокупателяСезонный");

	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказПокупателяСезонный.Ссылка
	             |ПОМЕСТИТЬ втЗаказПокупателяСезонные
	             |ИЗ
	             |	Документ.ЗаказПокупателяСезонный КАК ЗаказПокупателяСезонный
	             |ГДЕ
	             |	ЗаказПокупателяСезонный.БудетПредоплата = истина
	             |	И ЗаказПокупателяСезонный.Ссылка В(&СписокЗаказов)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаказПокупателя.Ссылка КАК ЗаказПокупателяДляПредоплаты
	             |ИЗ
	             |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаказПокупателяСезонные КАК втЗаказПокупателяСезонные
	             |		ПО ЗаказПокупателя.ДокументОснование = втЗаказПокупателяСезонные.Ссылка
	             |ГДЕ
	             |	ЗаказПокупателя.Номер ПОДОБНО ""СЗ%""
	             |	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
	             |	И ЗаказПокупателя.Проведен = ЛОЖЬ";
				 Запрос.УстановитьПараметр("СписокЗаказов",СписокЗаказов);
				 Рез = Запрос.Выполнить().Выбрать();
				 
				 Пока Рез.Следующий() Цикл
					 ЗаказОб = Рез.ЗаказПокупателяДляПредоплаты.ПолучитьОбъект();
					 ЗаказОб.УстановитьПометкуУдаления(истина);
					 ЗаказОб.Комментарий = ЗаказОб.Комментарий+ "; удален, т.к. документ основния был закрыт";
					 Попытка
						 ЗаказОб.Записать();
					 Исключение
					 КонецПопытки;
				 КонецЦикла;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателяСезонный") Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыПокупателейСезонныеОстатки.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейСезонныеОстатки.ВРезерве = ИСТИНА
		|			ТОГДА ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
		|		ИНАЧЕ -ЗаказыПокупателейСезонныеОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Количество,
		|	ЗаказыПокупателейСезонныеОстатки.Контрагент,
		|	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателяСезонный,
		|	ЗаказыПокупателейСезонныеОстатки.ВРезерве,
		|	ЗаказыПокупателейСезонныеОстатки.Аналог,
		|	ЗаказыПокупателейСезонныеОстатки.ЗаказПокупателя
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателейСезонные.Остатки(, ЗаказПокупателяСезонный = &ссылка) КАК ЗаказыПокупателейСезонныеОстатки";

	Запрос.УстановитьПараметр("ссылка", ДанныеЗаполнения.ссылка);

	Результат = Запрос.Выполнить().Выгрузить();
     ОстаткиПоЗаказам.Загрузить(Результат);
	КонецЕсли;
КонецПроцедуры
